tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.3);

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform (0 0 42.2);
    }
    inletair
    {
        type            fixedValue;
        value           uniform (0 0 0.3);
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0.3);
    }
    axis
    {
        type            empty;
    }
    leftside
    {
        type            fixedValue;
        value           uniform (0 0 0.3);
    }
    burnerwall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    burnertip
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    front
    {
        type            wedge;
    }
    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
